{
  "patches": [
    {
      "version": "1.0.0",
      "description": "Initial release of the application.",
      "changes": [
        "Added core functionality."
      ]
    },
    {
      "version": "2.0.0",
      "description": "Moved to a typescript code base and implemented an overlay.",
      "changes": [
        "Refactored codebase to TypeScript.",
        "Implemented overlay for better user experience.",
        "Introduced Settings section to manage the overlay based on user preference",
        "made the rotation details collapsable so it can be hidden when not being edited",
        "Fixed minor bugs from previous version."
      ]
    },
    {
      "version": "2.0.1",
      "description": "Optimisation and Bug Fixes",
      "changes": [
        "Optimisied the UI to reduce the lag.",
        "Fixed bugs related to overlay rendering.",
        "Updated the main header to be more unique to this app",
        "Fixed a bug with saving rotation names being null"
      ]
    },
    {
      "version": "2.1.0",
      "description": "Added patch notes.",
      "changes": [
        "Introduced patch notes feature to keep users informed about updates.",
        "Automatically view patch notes if the system detects a new version"
      ]
    },
    {
      "version": "2.1.1",
      "description": "Correct patch notes.",
      "changes": [
        "Corrected a typo in the 2.1.0 changes.",
        "Added a show patch notes button so that all patch notes can be viewed",
        "Ordered patch notes in descending order so that newer versions come first"
      ]
    },
    {
      "version": "2.1.2",
      "description": "Add Action Bug Fix.",
      "changes": [
        "The add action button wasn't working, sorry! it's fixed now."
      ]
    },
    {
      "version": "2.2.0",
      "description": "Allow multiple rotations per set for easy cycling between phases",
      "changes": [
        "Rotations are now saved in sets, the sets will contain one or many rotations! This means you can have a rotation for each phase of a boss, or just for convenience.",
        "Added the ability to have multiple rotations per set.",
        "Overlay now shows the selected rotation, and can cycle to the next rotation by pressing the main alt1 keybind (default is alt + 1).",
        "Updated the UI to accommodate multiple rotations.",
        "Moved the close button on this patch notes window to the top right corner so that it is more consistent with other windows."
      ]
    }
  ]
}